Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: If there is a time synchronization problem, the NFS server and local machine will have different times.
es_es: Si hay un problema de sincronización de tiempos, el servidor NFS y el equipo local tendrán tiempos diferentes.

source: If LIST is omitted, C<unlink> uses C<$_>.
es_es: Si LISTA se omite, C<unlink> utiliza C<$_>.

source: The undefined version is the value that indicates that there is no real value for something, such as when there was an error, or at end of file, or when you refer to an uninitialized variable or element of an array or hash.
es_es: La versión indefinida es el valor que indica que no existe ningún valor real para algo, como cuando hubo un error, se alcanzó el fin de archivo, o cuando se hace referencia a una variable o un elemento de array o hash no inicializados.

source: If FILEHANDLE is an undefined scalar variable (or array or hash element), a new filehandle is autovivified, meaning that the variable is assigned a reference to a newly allocated anonymous filehandle.
es_es: Si IDENTIFICADOR_FICHERO es una variable escalar indefinida (o array o elemento hash), un nuevo identificador de archivo es autovivificado, significando que a la variable es asignada una referencia a un nuevo, anónimo y reservado identificador de archivo.

source: Perl is supported by its users.
es_es: El soporte de Perl lo ofrecen sus usuarios.

source: =item parsing regular expressions X<regexp, parse>
es_es: =item analizando expresiones regulares X<regexp, parse> X<regexp, análisis>

source: Each regexp tries to match where the previous one leaves off.
es_es: Cada regexp intenta coincidir donde la anterior lo dejó.

source: chomp($user = <STDIN>);
es_es: chomp($usuario = <STDIN>);

source: Note that if an initialized scalar variable is used instead the result is different: C<my $fh='zzz'; open($fh, ...)> is equivalent to C<open( *{'zzz'}, ...)>.
es_es: Tenga en cuenta que si se usa una variable escalar ya inicializada, el resultado es diferente: C<my $fh='zzz'; open($fh, ...)> es equivalente a C<open( *{'zzz'}, ...)>.

source: eval '$x'; # CASE 3
es_es: eval '$x'; # CASO 3

source: The following scans a list of files (C<@files>) for a list of words (C<@words>), and prints out the names of those files that contain a match:
es_es: Lo siguiente examina una lista de archivos (C<@archivos>) por una lista de palabras (C<@palabras>), e imprime los nombres de los archivos que contienen una coincidencia:

source: All the operators which need an argument in the integer format treat the argument as in modular arithmetic, e.g., C<mod 2**32> on a 32-bit architecture.
es_es: Todos los operadores que necesitan un argumento con formato de entero tratan al argumento como en la aritmética modular (p. ej., C<mod 2**32> en una arquitectura de 32 bits).

source: The syntax for encoding text strings to binary strings is as simple as decoding:
es_es: La sintaxis para codificar cadenas de texto en cadenas binarias es tan sencilla como la sintaxis de descodificación:

source: @a = $ok ? @b : @c; # get an array
es_es: @a = $ok ? @b : @c; # obtiene un array

source: print v102.111.111; # prints "foo"
es_es: print v102.111.111; # imprime "foo"

source: This allows you to write:
es_es: Esto le permite escribir:

source: C<pos> directly accesses the location used by the regexp engine to store the offset, so assigning to C<pos> will change that offset, and so will also influence the C<\G> zero-width assertion in regular expressions.
es_es: C<pos> accede directamente a la ubicación utilizada por el motor de expresiones regulares para almacenar el desplazamiento, por lo que asignar a C<pos> cambiará ese desplazamiento, por lo que también influirá en la aserción de ancho cero C<\G> en las expresiones regulares.

source: Other functions do not, except accidentally.
es_es: Otras funciones no, excepto accidentalmente.

source: /(?<NAME>(?&NAME_PAT))(?<ADDR>(?&ADDRESS_PAT))
es_es: /(?<NOMBRE>(?&NOMBRE_PAT))(?<DIR>(?&DIRECCIÓN_PAT))

source: This is useful to check that a child process is still alive (even if only as a zombie) and hasn't changed its UID.
es_es: Esto es útil para comprobar que un proceso hijo aún está vivo (aunque sólo sea como un zombie) y no ha cambiado su UID.

source: As of Perl 5.10, it even has a case/switch statement (spelled C<given>/C<when>).
es_es: En Perl 5.10, incluso ofrece una instrucción case/switch (llamada C<given>/C<when>).

source: Removes the elements designated by OFFSET and LENGTH from an array, and replaces them with the elements of LIST, if any.
es_es: Elimina los elementos designados por DESPLAZAMIENTO y LONGITUD de un array, y los sustituye por los elementos de LISTA, si los hubiere.

source: See L<perlsyn/"Smart matching in detail">.
es_es: Vea L<perlsyn/"Coincidencia inteligente, en detalle">.

source: l A signed long (32-bit) value.
es_es: l Un valor de un largo con signo (32 bit).

source: F<ptargrep> is a utility to apply pattern matching to the contents of files in a tar archive.
es_es: F<ptargrep> es una utilidad que aplica detección de patrones al contenido de un archivo de almacenamiento tar.

source: This will optimize down to C<'foo'>, so C<'bar'> will never be considered (even though the rules say to use a smart match on C<'foo'>).
es_es: Esto quedará optimizado en C<'foo'>, así que C<'bar'> nunca será considerado (incluso aunque las reglas digan que hay que usar coincidencia inteligente en C<'foo'>).

source: next if /^\s*#/; # skip comments
es_es: next if /^\s*#/; # salta los comentarios

source: =head4 Which character set modifier is in effect?
es_es: =head4 ¿Qué modificares están activos?

source: print if /$arg/o; # compile only once (no longer needed!)
es_es: print if /$arg/o; # compilar solo una vez (¡ya no es necesario!)

source: Because C</> is equivalent to C<\/> inside a regular expression, this does not matter unless the delimiter happens to be character special to the RE engine, such as in C<s*foo*bar*>, C<m[foo]>, or C<?foo?>; or an alphanumeric char, as in:
es_es: Dado que C</> es equivalente a C<\/> dentro de una expresión regular, esto no importará a menos que el delimitador pase a ser un carácter especial para el motor de RE, como en C<s*foo*bar*>, C<m[foo]>, o C<?foo?>; o un carácter alfanumérico, como en:

source: The C<< => >> operator is helpful in documenting the correspondence between keys and values in hashes, and other paired elements in lists.
es_es: El operador C<< => >> es útil para documentar la correspondencia entre claves y valores de hashes, y otros elementos vinculados en listas.

source: If it is supported, it usually encodes the disk quota.
es_es: Si está soportada, usualmente codifica la cuota de disco.

source: The intent is to propagate bug fixes out to stable releases more rapidly and make upgrading stable releases less of an upheaval.
es_es: La intención es propagar la corrección de errores a versiones estables con mayor rapidez y hacer esas actualizaciones menos problemáticas.

source: To signal the semaphore, replace C<-1> with C<1>.
es_es: Para señalizar el el semáforo, reemplace C<-1> con C<1>.

source: warn "not an integer" unless /^[+-]?\d+$/;
es_es: warn "no es un entero" unless /^[+-]?\d+$/;

source: Aggregation of this Package with a commercial distribution is always permitted provided that the use of this Package is embedded; that is, when no overt attempt is made to make this Package's interfaces visible to the end user of the commercial distribution.
es_es: La agregación de este Paquete con una distribución comercial siempre está permitida siempre que el uso de este Paquete esté integrado; es decir, cuando no se haga un evidente intento de hacer las interfaces del Paquete visibles para el usuario final de la distribución comercial.

source: Conversely, if any element of LIST is NOT an lvalue, any attempt to modify that element will fail.
es_es: Recíprocamente, si cualquier elemento de LISTA NO es un I<lvalue>, cualquier intento de modificar este elemento fallará (provocará un error).

source: Unstable CPAN modules
es_es: Módulos inestables de CPAN

source: $$x++; # CASE 6
es_es: $$x++; # CASO 6

source: (?{print "hello"}) # print hello whenever this # branch is tried
es_es: (?{print "hola"}) # imprime hola cuando esta # rama es probada

source: =head2 Other incompatible changes
es_es: =head2 Otros cambios incompatibles

source: If the initial value specified isn't part of a magical increment sequence (that is, a non-empty string matching C</^[a-zA-Z]*[0-9]*\z/>), only the initial value will be returned.
es_es: Si el valor inicial especificado no es parte de una secuencia mágica de incremento (es decir, una cadena no vacía coincidente con C</^[a-zA-Z]*[0-9]*\z/>), sólo se devolverá el valor inicial.

source: They I<are> reserved with respect to labels and filehandles, however, which don't have an initial special character.
es_es: Sí I<están> reservadas, sin embargo, para las etiquetas e identificadores de archivo, ya que éstos no tienen un carácter especial al comienzo.

source: j A Perl internal signed integer value (IV).
es_es: j Un valor Perl interno entero con signo (IV).

source: eval "require $class";
es_es: eval "require $clase";

source: If the VERSION argument is present between Module and LIST, then the C<use> will call the VERSION method in class Module with the given version as an argument.
es_es: Si el argumento VERSIÓN está presente entre el Módulo y la LISTA, entonces C<use> llamará al método VERSIÓN en la clase Módulo con la versión dada como argumento.

source: Described in L<perlreftut>, L<perlref>, L<perldsc>, and L<perllol>.
es_es: Se describe en L<perlreftut>, L<perlref>, L<perldsc> y L<perllol>.

source: C<$'> returns everything after the matched string.
es_es: C<$'> devuelve todo lo posterior a la cadena coincidente.

source: =head2 New "Newline in left-justified string for %s"
es_es: =head2 Nuevo "I<Newline in left-justified string for %s>" (Avance de línea en cadena justificada a la izquierda para %s)

source: The defined version is just a string of length zero, such as C<"">.
es_es: La versión definida es sólo una cadena de longitud cero, tal como C<"">.

source: Typically it would be the first declaration in a file included by C<require> or C<use>.
es_es: Normalmente será la primera declaración en un archivo incluido por medio de un C<require> o C<use>.

source: for (@ary) { s/foo/bar/ }
es_es: for (@array) { s/foo/bar/ }

source: eight (the high bit) is set on each byte except the last.
es_es: octavo (el bit más alto) es puesto en cada byte excepto el último.

source: This is actually a change introduced in perl 5.12.0, but it was missed from that release's perldelta.
es_es: Esto es realmente un cambio introducido en Perl 5.12.0, pero no se incluyó en el perldelta del lanzamiento.

source: $sentence =~ s{$substring}{big bad wolf};
es_es: $instruccion =~ s{$subcadena}{gran lobo malo};

source: say() is a new built-in, only available when C<use feature 'say'> is in effect, that is similar to print(), but that implicitly appends a newline to the printed string.
es_es: say() es una nueva función integrada; sólo está disponible cuando C<use feature 'say'> está en vigor, que es similar a print(), pero que, implícitamente, añade un carácter de nueva línea a la cadena a ser impresa.

source: Returns the current process group for the specified PID.
es_es: Devuelve el actual grupo del proceso especificado por el PID.

source: C<eval BLOCK> does I<not> count as a loop, so the loop control statements C<next>, C<last>, or C<redo> cannot be used to leave or restart the block.
es_es: C<eval BLOQUE> I<no> cuenta como un bucle, así que las instrucciones de control de bucle C<next>, C<last>, o C<redo> no pueden ser usadas para dejar o reiniciar el bloque.

source: You can see whether your Perl was built with PerlIO by running C<perl -V> and looking for the C<useperlio=> line.
es_es: Puede ver cuándo su Perl se ha compilado con PerlIO ejecutando C<perl -V> y buscando por la línea C<useperlio=>.

source: The status value of the command is returned in C<$?> (see L<perlvar> for the interpretation of C<$?>).
es_es: El valor de estado del comando se devuelve en C<$?> (Vea L<perlvar> para la interpretación del valor de C<$?>).

source: A reference to a subroutine.
es_es: Una referencia a una subrutina.

source: It's easy to grow to a rather large data space this way, so use with care.
es_es: De esta manera, es fácil que el espacio ocupado por los datos crezca a un gran tamaño, así que tenga cuidado.

source: If that works, good.
es_es: Si esto funciona, bien.

source: TIEHANDLE classname, LIST
es_es: TIEHANDLE clase, LISTA

source: Unlike the mechanisms mentioned above, these affect operations besides regular expressions pattern matching, and so give more consistent results with other operators, including using C<\U>, C<\l>, etc. in substitution replacements.
es_es: A diferencia de los mecanismos mencionados anteriormente, estos afectan a las operaciones de coincidencia de las expresiones regulares, y así obtener resultados más consistentes con otros operadores, incluyendo el uso de C<\U>, C<\l>, etc, en la parte de la sustitución en los reemplazos.

source: BUILD - Non-threaded Case - Threaded Case - Testing - Installing the built perl
es_es: COMPILACIÓN - Caso de no enhebrado - Caso de enhebrado - Pruebas - Instalando el perl compilado

source: Various Copy-On-Write techniques will be investigated in hopes of speeding up Perl.
es_es: Varias técnicas Copy-On-Write serán investigadas con la esperanza de acelerar Perl.

source: =item when BLOCK
es_es: =item when BLOQUE

source: Forces EXPR to be interpreted in scalar context and returns the value of EXPR.
es_es: Fuerza EXPR a ser interpretada en contexto escalar y devuelve el valor de EXPR.

source: (On some machines, unfortunately, the elapsed time may be up to one second less or more than you specified because of how seconds are counted, and process scheduling may delay the delivery of the signal even further.)
es_es: (En algunas máquinas, desafortunadamente, el tiempo transcurrido puede ser hasta un segundo más o menos del especificado debido a cómo los segundos son contados, y la planificación de procesos pueden retrasar la entrega de la señal incluso más).

source: | Alternation
es_es: | Alternativas

source: =head2 Administration
es_es: =head2 Administración

source: =head2 Pre-requisites
es_es: =head2 Pre-requisitos

source: =item log EXPR X<log> X<logarithm> X<e> X<ln> X<base>
es_es: =item log EXPR X<log> X<logarithm> X<e> X<ln> X<base> X<logaritmo>

source: # and, in case someone appended while we were waiting...
es_es: # y, en caso de que alguien haya añadido algo mientras esperábamos...

source: The range operator is useful for writing C<foreach (1..10)> loops and for doing slice operations on arrays.
es_es: El operador rango es útil para escribir bucles C<foreach (1..10)> y para hacer operaciones de troceado en los arrays.

source: Returns a list consisting of all the values of the named hash, or the values of an array.
es_es: Devuelve una lista consistente de todas las claves del hash indicado, o los índices de un array.

source: In the second form, the code within the BLOCK is parsed only once--at the same time the code surrounding the C<eval> itself was parsed--and executed within the context of the current Perl program.
es_es: En la segunda forma, el código dentro del BLOQUE es interpretado sólo una vez -al mismo tiempo que el código que rodea al mismo C<eval> es interpretado- y ejecutado dentro del contexto del actual programa Perl.

source: It behaves just as C<import> does with VERSION, an omitted or empty LIST, or no unimport method being found.
es_es: Se comporta igual que C<import> lo hace con VERSIÓN, con una lista vacía o no, o ningún método unimport será encontrado.

source: # if the open fails, output is discarded
es_es: # si open falla, la salida es descartada

source: This document describes the layout of the Perl source tree.
es_es: En este documento se describe el contenido del árbol de código fuente de Perl.

source: =item keys HASH X<keys> X<key>
es_es: =item keys HASH X<keys> X<key> X<clave>

source: Two of these directories contain modules that live in the core, and two contain modules that can also be released separately on CPAN.
es_es: Dos de estos directorios contienen módulos integrados en el núcleo y los otros dos contienen módulos que además se publican en CPAN.

source: A line-oriented form of quoting is based on the shell "here-document" syntax.
es_es: Un formato de entrecomillado orientado a líneas basado en la sintaxis shell "here-document" (este-documento, documento incrustado).

source: No implicit conversion to C<""> is done (as was the case in perl 5.10.0).
es_es: No se realiza conversión implícita a C<""> (como era en el caso de Perl 5.10.0).

source: Therefore perl 5.8.1 introduced a "backdoor" to restore the pre-5.8.0 (pre-5.7.3, really) signal behaviour.
es_es: Por lo tanto, perl 5.8.1 introdujo una "puerta trasera" para restaurar el pre-5.8.0 (pre-5.7.3, en realidad) comportamiento de las señales.

source: C<Storable> upgraded to version 2.15
es_es: C<Storable> actualizado a la versión 2.15

source: my @transformed = map { ... } @input; # syntax error
es_es: my @transformado = map { ... } @entrada; # error de sintaxis

source: Operator precedence and associativity work in Perl more or less like they do in mathematics.
es_es: Precedencia de operadores y asociatividad funciona en Perl más o menos como se hace en matemáticas.

source: if (@animals < 5) { ... }
es_es: if (@animales < 5) { ... }

source: It has a low-precedence counterpart, C<err>, which has the same precedence and associativity as C<or>.
es_es: Tiene un homólogo de baja prioridad, C<err>, que tiene la misma prioridad y asociatividad que C<or>.

source: The test t/uni/tr_7jis.t is known to report failure under 'make test' or the test harness with certain releases of IRIX (at least IRIX 6.5 and MIPSpro Compilers Version 7.3.1.1m), but if run manually the test fully passes.
es_es: La prueba t/uni/tr_7jis.t se sabe que da un informe de fallo bajo 'make test' o la prueba se cuelga con determinadas versiones de IRIX (por lo menos la IRIX 6.5 y compiladores MIPSpro versión 7.3.1.1m), pero si se ejecuta manualmente la prueba pasa de forma completa.

source: You can now use a non-arrowed form for chained subscripts after a list slice, like in:
es_es: Ahora puede utilizar una forma de no-flecha para los subíndices encadenados después de una porción de una lista, como en:

source: assigns the entire list value to array @foo, but
es_es: asigna la lista completa al array @foo, pero

source: To be pedantic, the comparison is actually C<int(EXPR) == int(EXPR)>, but that is only an issue if you use a floating point expression; when implicitly using C<$.> as described in the previous paragraph, the comparison is C<int(EXPR) == int($.)> which is only an issue when C<$.> is set to a floating point value and you are not reading from a file.
es_es: Para ser pedante, la comparación es en realidad C<int(EXPR) == int(EXPR)> , pero esto sólo es un problema si utiliza una expresión de punto flotante; cuando, implícitamente, está usando C<$.> como se describe en el párrafo anterior, la comparación es C<int(EXPR) == int($.)> que sólo es un problema cuando C$.> se establece en un valor de punto flotante y usted no está leyendo de un archivo.

source: =head1 DIAGNOSTICS
es_es: =head1 DIAGNÓSTICO

source: Thus C<redo> inside such a block will effectively turn it into a looping construct.
es_es: Por lo tanto C<redo> dentro de un bloque lo convertirá de forma efectiva en una construcción de bucle.

source: This may be addressed in a future version of perl.
es_es: Esto puede ser cambiado en una futura versión de perl.

source: sub process {
es_es: sub procesa {

source: They are: Benjamin Smith, Jan-Pieter Cornet, Johan Vromans, Lukas Mai, Nathan Gray.
es_es: Son: Benjamin Smith, Jan-Pieter Cornet, Johan Vromans, Lukas Mai, Nathan Gray.

source: If unimplemented, raises an exception.
es_es: Si no está implementada, lanza una excepción.

source: Not really a function.
es_es: No es realmente una función.

source: n An unsigned short (16-bit) in "network" (big-endian) order.
es_es: n Un corto sin signo (16 bit) en orden "red" (big-endian).

source: Unsupported private C API functions are now declared "static" to prevent leakage to Perl's public API.
es_es: Funciones privadas C de la API, no soportadas, están ahora declaradas como "estáticas" para evitar la fuga hacia la API pública de Perl.

source: If the starting delimiter is an opening punctuation (that is C<(>, C<[>, C<{>, or C<< < >>), the ending delimiter is the corresponding closing punctuation (that is C<)>, C<]>, C<}>, or C<< > >>).
es_es: Si el delimitador inicial es un carácter de puntuación (uno como C<(>, C<[>, C<{>, o C<< < >>), el delimitador final es el correspondiente carácter de puntuación, de cierre (uno como C<)>, C<]>, C<}>, o C<< > >>).

source: (In scalar context, returns the number of keys or indices.)
es_es: (En contexto escalar, devuelve el número de claves o índices).

source: $class = 'Foo::Bar';
es_es: $clase = 'Foo::Bar';

source: This document describes differences between the 5.8.3 release and the 5.8.4 release.
es_es: Este documento describe las diferencias entre la versión 5.8.3 y la versión 5.8.4.

source: Keep your documentation near the code it documents ("inline" documentation).
es_es: Mantenga la documentación cerca del código que documenta (documentación "en línea").

source: range operator (creates a list of numbers)
es_es: operador de intervalo (crea una lista de números)

source: =head2 Internals and C Language Interface
es_es: =head2 Componentes e interfaz con el lenguaje C

source: It's easier to use a hash like this:
es_es: Es más fácil utilizar un hash de esta manera:

source: It's also a more insistent form of close because it also disables the file descriptor in any forked copies in other processes.
es_es: También es una forma más insistente de cerrar, ya que también desactiva el descriptor de archivo en cualquier copia bifurcada en otros procesos.

source: $re = qr/$pattern/;
es_es: $re = qr/$patron/;

source: Perl is a B<free-form> language, you can format and indent it however you like.
es_es: Perl es un lenguaje de B<estructura libre>, puede formatearlo y sangrarlo como quiera.

source: The string you supply will be cut off at 16 bytes, this is a limitation imposed by Linux.
es_es: La cadena que suministre será recortada a los 16 bytes, que es una limitación impuesta por Linux.

source: The support for assertions, introduced in perl 5.9.0, has been improved.
es_es: El soporte para aserciones, introducida en Perl 5.9.0, se ha mejorado.

source: =head1 Caching
es_es: =head1 Cacheado

source: A simple comment in the code giving credit to the FAQ would be courteous but is not required.
es_es: Le agradeceremos que incluya en su código una mención a estos documentos de preguntas más frecuentes, pero no le exigimos que lo haga.

source: If the repeat count is C<*>, the offset is relative to the start of the packed string.
es_es: Si el número de repeticiones es C<*>, el desplazamiento es relativo al inicio de la cadena empaquetada.

source: Now linenumbers can go all the way to 4294967296, or 2**32.
es_es: Ahora, los números de línea puede ir hasta 4294967296, o 2**32.

source: Perl does its own C<sprintf> formatting: it emulates the C function sprintf(3), but doesn't use it except for floating-point numbers, and even then only standard modifiers are allowed.
es_es: Perl hace su propio formateo C<sprintf>: emula la función del C sprintf(3), pero no la usa, excepto para los números en coma flotante, y aún entonces sólo se admiten modificadores estándares.
